[{"title":"支付清结算之基本概念和入门（转）","date":"2016-11-19T06:48:00.000Z","path":"2016/11/19/zhifu_qingjiesuanrumen/","text":"搞明白了清结算，你就明白了支付业务是怎么运转的。 从技术上来说，清结算并不是最难的，风控、信用，实施起来比清结算难多了。但从业务的角度来说，清结算可以说是最难理解的支付业务过程了。 它牵扯到支付所有相关的概念。为了降低理解难度，我们从常见的支付行为入手，逐步分析清结算如何进行。 支付流程先说个比较简单的支付场景，用户（姑且称他为小明）用绑定的银行卡（用宇宙第一大行工行为例）来购买某电商公司（老熊公司）的产品。小明需要先在老熊公司网站上完成银行卡绑定的操作，绑卡的过程参见之前的文档支付系统之绑卡、签约和身份验证。绑卡以后，就可以使用这个卡来购买商品。 首先是挑选商品和下单，其后是执行支付。下单之前的流程不做介绍， 我们从支付开始，来说明支付过程中的清结算问题。 为了简化，我们先从比较简单的同渠道、公司内购买的场景来开始。商品也先假定为虚拟产品，比如会员卡。 为了实现这个流程，有一些前置的操作需要完成： 老熊公司已经对接了工行的快捷支付接口。通过这个接口，可以实现绑卡（签约）、支付、退款、查单等操作。如何对接，参见文档支付系统之银行卡支付。 老熊公司已经按照工行的要求，在工行开了对公账户。老熊公司通过工行接口的所有收款、退款等资金往来，都发生在这个账户上。 小明在老熊公司的应用中绑定了自己的一张卡，为了简化处理，小明绑定的也是工行的卡，先省略掉跨行结算的步骤。具体的绑卡流程参见支付系统之绑卡、签约和身份验证。 用户小明在手机或者PC Web上购买了100元的虚拟产品，比如很多公司会使用的会员卡。这里我们先从虚拟物品入手，因为实体物品情况会复杂一点，供应链和物流也是一个大课题，购买实体物品就需要考虑这个问题，而虚拟产品就可以暂不考虑。然后小明在网站上执行下单、支付操作。 老熊公司的支付系统接收到小明的支付操作请求后，系统首先会校验订单是否有问题，然后调用工行快捷支付接口，从用户的工行卡上扣除100元， 用户的工行卡的扣款是实时进行的，也就是说，这个操作完成后，小明查看他的工行余额和流水，会有一笔100元的交易，并且账户余额也减少了100元。 但是这个钱并不是直接就进入了老熊公司的（结算）账户上的。工行在第二天凌晨会对前天的交易进行清算和结算。在计算收入的同时，也从中扣除掉通道费用，得到最终应该划拨到结算账户上的金额。在这个例子中我们假定手续费按支付金额收费，比例为0.1%。 这一笔交易，支付给工行0.10元，公司收入99.9元。 交易流水用户执行支付后，系统首先需要记录交易流水，流水的内容包括： 交易主体：即发起本次交易的出款的用户，一般是记录ID、姓名等信息。 交易账户：即用户购买时使用的出款的账户，这是用户在工商银行的卡，实际账户是建立在工行，但在电商系统中，为了便于结算，为这个账户建立一个代理。这个账户在系统中的ID是10001（数据本身无其他含义） 交易对手：即出卖虚拟产品的业务部门，一般记录部门的ID、名称等信息。 结算收益： 交易对手能够拿到的金额。这里是 支付金额-渠道费用，即99.9元 对手账户：即虚拟产品的收款账户，为了便于结算，公司一般会对每项业务设置独立的结算账户。这个账户在系统中的ID是 20001（数据本身无其他含义）。 交易渠道：即工商银行的快捷支付，还需要记录渠道的ID， 名称等； 渠道结算账号：这也是个代理账号，记录在渠道侧的交易流水。 渠道提交时间：请求渠道执行支付的时间； 渠道支付时间：渠道一般会在返回的报文中说明本次交易的执行时间。 如果没有，则使用渠道的支付接口返回时间。 渠道费率：渠道的手续费，这里假定工行是按支付金额收费，比例为支付金额的0.1%。 渠道费用：这里是支付金额*手续费率， 即0.1元。 发起交易日期：2016年12月12日 13:00:10，即用户提交订单后，虚拟产品业务调用支付系统接口执行支付的时间。 执行交易日期： 2016年12月12日 13:00:11，即支付系统接口调用时间。 支付截止日期：必须在此日期前完成支付。 订单信息：在本例子中是会员卡，一般需要记录业务方订单ID、名称、内容等信息。 订单金额：提交过来的原始订单的金额 100元； 支付金额： 用户实际支付的金额，由于没有使用优惠券、打折卡等，这里支付金额等于订单金额，都是100元。 没有使用卡券、没有和合作方分成，这两块内容暂不记录。 交易流水是在完成支付时实时生成的。这个流水信息是后续记账的依据，所以务必在流水中真实记录能收集到的所有的现场信息。 这里从： 交易主体，即掏钱的小明 交易对手，即收钱的业务方 交易渠道，即工行快捷 交易商品，即会员卡 角度来多方位全角度的描述这笔交易。大家会注意到这里有不少冗余信息。实际上对交易涉及到所有可能会被修改的信息，比如用户姓名，商品名称，商品价格，都需要在这里留一个快照，以便后续回溯和审核。 会计主体不用说，这一笔账是老熊公司的账务，不是工行的账务，也不是小明家的账务。虽然这里会有工行和小明的信息，但记账的目的是为了了解和改进老熊公司的经营状况服务的。 老熊公司不是某个大公司的分公司或者子公司，它是一家独立核算的、具有独立的资金和经营业务的单位，从会计学角度来说，他是一个独立的会计实体。 会计要素从概念上来说，所有和钱有关的活动，买会员、用户充值、支付手续费等，都需要记账，这些活动，称之为会计对象。 每个公司都有不同的会计对象，有时候同一类活动，叫法还不一样。如果直接用这些活动内容来记账，那就没法比较每个公司的情况。 比如新浪说我家微博广告收入300万，网易说我家卖猪收入了300万，到底谁家更赚钱？需要有一个记账的标准，让大家分门别类的做记录。对会计对象做规范化的管理，这就引入会计要素的概念。 会计要素是对会计对象进行的基本分类，是会计核算对象的具体化。 如果说会计对象是个Object，则会计要素是定义这个Object的Class。 不同的国家对会计要素有不同的规定。 国际会计准则委员会（IASC）在《编制和呈报财务报表的结构》将会计要素其归类为资产、负债、权益、收益和费用五个要素。美国财务会计准则委员会（FASB）在《财务会计概念公告》中将会计要素归类为资产、负债、所有者权益(净资产)、业主投资、派给业主款、综合收益、营业收入、费用、利润、损失十个要素。 我国《会计准则》将会计要素归类为资产、负债、所有者权益、收入、费用和利润六个要素。 其中资产、负债和所有者权益，是反应公司的财务状况的；它满足如下恒等式： 资产=负债+所有者权益 收入、费用和利润，是反应公司动态的经营成果的，满足如下恒等式： 收入—费用=利润 会计科目六大会计要素指明了需要记账的scope，但毕竟粒度还是太大了。为了更详细地了解公司财务情况，引入会计科目来对会计对象进行第二层次的划分。使用IT的语言来说，会计科目其实就是一个分类体系，用来分门别类地记账。 在实现上，他也是一个编号+名称，IT俗称字典表。 从定义上来说，会计科目是指一个涵义明确、概念清楚、简明扼要、通俗易懂的标准名称。 会计科目按照经济内容的性质不同，可以分为资产类科目、负债类科目、所有者权益类科目、损益类科目，成本类科目，有些金融企业还有资产负债共同类科目。在每一类会计科目下，还可以继续细分，详细内容可以参考2016年财政部发布的新会计准则。 会计科目和要素之间的关系： 会计科目还分为总账科目和明细科目。从IT角度，可以认为总账科目是一级分类，而明细科目则是这个一级分类下的二级、三级，甚至更多级别的详细的科目。 记账时，会同时记录到总账、明细科目。 在电商的支付系统中，一般会设置如下科目： 1002 银行存款(资产类)100201 业务收款100201001 支付宝收款100201002 工行收款100201003 建行收款1004 服务成本（成本类）100401 支付平台手续费用100401001 支付宝手续费100401002 工行手续费100401003 建行手续费6001 主营业务收入（损益类）6001001 会员卡业务6001001 游戏业务 会计账户账户是指对会计要素的具体内容所作的科学的分类，其包括两方面的内容：账户的名称、账户的用途与结构。会计科目是设置账户的依据，也是账户的名称。 比如对银行存款这个会计科目，也会设置一个对应的银行存款账户，用来跟踪公司在银行存款的变动。 在这个案例中，将设置的账户同会计科目。 记账凭证想想在以前没有电脑的时候，去买公交卡，公交公司阿姨会认真地记录你买的卡的卡号、买卡人的姓名、卡的面值等信息，运气好的时候还会给个发票。 一般来说，阿姨会将购买记录登记到一个账册上，形成记账凭证，并在这里会登记发票号码。在现在高科技时代，这个凭证还是少不了了。 先说明细账，记录内容如下： 这里详细记录每一条交易信息，当然，通过计算机系统，可以记录更多详情，包括时间、地点等。 会计分录和记账大家经常看到的记录应该是这样的： 借： 银行存款-工行收款 100 贷： 主营业务收入-会员卡 100借： 服务成本-工行手续费 0.1 贷：银行存款-工行收款 0.1 如上， 银行存款、服务成本、主营业务收入，属于总账科目，而工行收款、会员卡、工行手续费，属于明细科目。 这里采用的是复式记账法中借贷记账法。 对应的账户结构如下： 借贷复式记账法的特点是： 采用借、贷作为记账符号，建立在会计恒等式基础上，遵循有借必有贷，借贷必相等的原则。 账户基本结构是： 左侧为借，右侧为贷。 一般采用如上图所示的T行账户的形式来描述。 借贷所代表的增加、减少的含义并不固定，和账户的性质有关。 借方 贷方 资产增加 资产减少 权益减少 权益增加 成本增加 成本减少 收入减少 收入增加 费用及支出增加 费用及支出减少 更多问题作为清结算的入门介绍，这里介绍的是最简单的场景，以此来解释清结算相关的概念，特别是会计学一些从IT角度不容易理解的名词。实际上，这个场景还有很多问题： 严格的说，会员卡的收入，还不能立即作为公司主营业务收入。会员卡是预付款项，用户开始使用会员卡，公司需要为这个使用提供服务；用户结束使用会员卡之后，这一笔开支才算是真正落入公司主营业务收入中。 会员卡在使用期间，公司针对会员业务的各种开销，要分摊到这一段期间的会员上。将开销分摊到每张会员卡上，计算其使用成本，最终才能够计算出收益。 用户会员卡购买的款项并不是立即到对公的结算账户的，一般是T+1结算，也就是第二天银行才会将清算好的资金打到公司结算账户上，这种情况应该如何记账？ 如果支付过程中使用了代金券和优惠券，那又应该如何考虑？ 此外，还有退款、充值等场景的清结算，这些问题都将在本系列的文章中详细介绍。本文仅介绍一些相关的概念， 欢迎大家继续关注后续内容。","tags":[{"name":"支付","slug":"支付","permalink":"http://yoursite.com/tags/支付/"},{"name":"清结算","slug":"清结算","permalink":"http://yoursite.com/tags/清结算/"}]},{"title":"在线支付流程简介（转）","date":"2016-07-13T12:46:25.000Z","path":"2016/07/13/zhifu_liuchengjianjie/","text":"相关概念我们以收银台为例，详细说明支付的正确打开方式。 当用户提交订单后，就会被引导到收银台上。 以某东为例，手机上是这样的： PC上是这样的： 从这里我们可以看出，用户进入收银台之后，首先需要选择默认的支付方式。 支付方式指消费时付款的方式，比如现金支付、货到付款、信用卡支付、借记卡支付、扫码支付等。 那么有哪些支付方式适合在收银台上展示出来？ 这就是支付应用和支付方式的关系。在这里，收银台是一类支付应用。 支付应用指提供给最终用户在特定场景下使用的产品，比如扫码收银、二维码支付、打赏、众筹、POS支付、生活缴费、信用卡返款、手机充值等。 这些应用是建立在支付产品的基础之上，直接面向最终的用户提供服务。 每个支付应用可以用的支付方式是不一样的。比如说，扫码收银，可能仅支持微信和支付宝。POS支付，仅支持银行卡。而信用卡返款，只能从其他的借记卡上去扣款。支付应用的设计和公司的业务有关，并需要考虑在公司业务场景下的用户支付体验。目前应用最全的数支付宝，可以参观下支付宝的应用（截止至2017年2月15日）： 在收银台这个应用中，在呈现支付方式时，哪些支付方式可以提供给当前场景下的用户来使用，哪个方式应该排在前面，这在支付系统中，是通过引导路由来实现的。 引导路由是根据支付应用、收款商户、订单额度等信息来决定提供给用户的支付方式列表。 当用户选择一种支付方式并提交支付后，支付系统开始执行扣款。比如用户选择通过招行来支付，系统就会请求招行来扣款吗？ 这不一定，因为系统有可能并没有接入到招行接口。除了招行自己的接口外，第三方支付公司、银联等，也可以从招行卡上扣款。那应该使用哪个通道合适？ 这是通过支付路由来决定的。 支付路由指根据用户选择的支付方式，结合费率、QOS等因素，选择合适的银行或者其他公司提供的支付接口来完成资金转移操作。 通过支付路由，我们可以定位到一个落地来执行的支付接口。 支付接口，指由银行提供的用来执行支付的接口。这里要注意，对于同一家银行，除了总行可以提供一个接口，各地的分行也可以提供这个接口。 但一般来说，同一家银行的接口规范是一样的，不同的是提供接口的服务器、费率、性能等。 比如，支付公司可以接入工行总行、工行上海分行、工行北京分行的接口。为什么要接入分行呢？ 一般来说，不少分行会提供更优惠的接入费率，以及经常会举办一些活动来吸引用户接入。 支付通道，这是对支付接口的一个封装，包含合作银行以及通道成本、商户费率、QOS等信息 银行和第三方支付等渠道提供给电商公司使用的接口，往往都会封装成支付产品。 支付产品指将支付通道打包成满足某特定支付场景需求的商品，比如信用卡快捷、信用卡Moto等。 在这里我们把涉及到的几个概念都做了定义。 当然，这些定义仅仅是从约定俗成的角度来描述，不具有学术意义。 不同的公司，对这些名称叫法还不完全一致。 比如支付通道，有些叫渠道，有些公司叫网关。这里统一一下称呼，避免混淆。 总的来说，支付系统是把支付通道提供的“支付产品” 使用支付路由来封装成业务需要的“支付产品”。这就是支付的核心流程。支付路由在其中起着关键作用。 参与者支付系统会涉及到如下参与者。 客户客户指与某个商家有交易关系并且存在未清偿的债权和债务关系的一方。 客户使用自己拥有的支付工具来发起支付，是支付操作运作的发起者之一。在交易中，也成为交易主体。 商家商家是拥有债权的商品出售者，他根据客户发起的支付指令向支付系统发起请求，要求获取资金。 商家需要获取和支付系统接入的权限，一般是在服务器端和支付系统交互。 客户开户行也成为发卡行、发卡机构等。 指客户拥有账户的支付渠道。 客户需要使用支付渠道所支持的支付工具来发起支付。这个工具也意味着一种信用，保证支付工具的兑付。 商户开户行指商家用来接受资金的账户的所在银行。 商户将客户指令提交给其开户行后，由开户行发起支付授权的请求进行银行间清算的工作。 商家开户行是根据商家提供的账单工作的，也成为收单机构。 运营人员支付系统的运营人员除了常规的业务拓展外，还负责对支付业务状态进行监测，配置和管理渠道的密码秘钥、对账处理等日常工作。 风控人员一般风控和运营是分开的。 风控人员负责每天审核被拦截的交易的情况，发现可能潜在的风险，配置风控规则，确保支付系统的资金安全。 财务会计和钱打交道，在任何公司，都跑不掉财务部门。 那财务部门会关注哪些内容？ 当然，最重要的是账务信息。 所有的交易都要记账，按要求公司都需要定期做审计，每一笔帐都不能出错。这当然不能等到审计的时候再去核对，而是每天都需要对账，确保所有的交易支出相抵，也就是所说的把账给平了。 这就有三种情况： 电商系统和商家对账；电商系统和支付系统对账；支付系统和收单机构对账。在支付系统中，我们仅关注后两者的情况。运营人员是和“信息流”打交道，而财务会计需要和“资金流”打交道，核实每个渠道的资金情况，对备付金按照运营的要求进行充值调度等。 业务流程我们以电商系统的订单支付为例，看看支付系统中需要提供的基本功能。 1.用户提交订单到电商系统，电商系统对订单进行检验，无问题则调起支付接口执行支付。注意这里支付接口是在服务器端调起的。一般支付接口很少从客户端直接调起。为了安全，支付接口一般要求用HTTPS来访问，并对接口做签名。 2.支付系统检查参数有效性，特别是签名的有效性。 3.根据用户选择的支付方式，以及系统支付路由设置，选择合适的收单机构。这里涉及三个概念，支付方式，支付路由。这又是一个槽点。简单说，用户可以选择各种银行卡支付，比如宁波银行卡，但是你的支付系统没有对接宁波银行，那对这种卡，可以选择你接入的，支持这个卡的收单机构来执行支付，如用微信或者支付宝等等第三方支付，或者银联支付等系统支持的方式来执行。这就是支付路由，根据用户提供的银行卡来选择合适的收单机构去执行支付。常用支付方式还包括第三方支付，如微信支付宝等，这种情况下就不需要支付路由了。 4.调用收单接口执行支付。这是支付系统的核心。每个公司的收单接口都不一样，接入一两个收单机构还好，接入的多了，如何统一这些接口，就是一个设计难点。 5.支付成功，收单机构把钱打到商户的账户上了。 商家就准备发货了。 怎么发货，不是本文的重点。 这里关注的要点是， 商家能收到多少钱？ 比如100块钱的商品，用户支付了100块钱（运费、打折等另算），这100块钱，还要刨去电商系统的佣金、支付通道的手续费，才能最终落到商家手里。 这是个Happy流程，一切看起来都很美好，但实际上步步都是坑，一旦有地方考虑不周全，轻者掉单频发，重者接口被盗刷，损失惨重。 如何避免攻击者修改支付接口参数， 比如100块钱的东西，改成10块钱？ 调用收单接口来执行最终实际支付时，如果支付失败了，比如卡上没钱了，怎么办？ 收单接口把账户上的钱扣走了，但是通知支付系统的时候出错了（比如网络闪断，或者支付系统重启了），支付系统不知道这笔交易已经达成了，怎么处理？ 还有好多问题….非功能需求 从软件开发角度， 还有一些非功能性需求需要实现： 性能： 特别是秒杀的时候，如何满足高频率的支付需求？ 可靠性：不用说，系统能达到几个9，是衡量软件设计功力的重要指标。 99%是基础， 99.999%是目标，更多的9哪就是神了。 易用性：支付中多一个步骤，就会流失至少2%的用户。 产品经理都在削尖脑袋想想怎么让用户赶紧掏钱。 可扩展性： 近年来支付业务创新产品多，一元购、红包、打赏等，还有各种的支付场景。 怎么能够快速满足产品经理的需求，尽快上线来抢占市场，可扩展性对支付系统设计也是一个挑战。 可伸缩性：为了支持公司业务，搞一些促销活动是必须的。 那促销带来的爆发流量，最佳应对方法就是加机器了。 平时流量低，用不了那么多机器，该释放的就释放掉了， 给公司省点钱。 这里从流程和概念的角度分析支付系统应该支持的基础功能。 后续我们将以此为基础，探讨支付系统的设计。","tags":[{"name":"支付","slug":"支付","permalink":"http://yoursite.com/tags/支付/"},{"name":"概念","slug":"概念","permalink":"http://yoursite.com/tags/概念/"}]}]